Revit 2027 API
DWFImportOptions(IList<ElementId>) Constructor
 Constructs a new instance of DWFImportOptions with an array of imported sheet views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DWFImportOptions(
	IList<ElementId> views
)
Public Sub New (
	views As IList(Of ElementId)
)
public:
DWFImportOptions(
	IList<ElementId^>^ views
)
new :
        views : IList<ElementId> -> DWFImportOptions
Parameters
views IList<ElementId>
 These sheet views where DWF markups are imported.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DWFImportOptions Class
DWFImportOptions Overload
Autodesk.Revit.DB Namespace